src/DocumentJournals/ЖурналЧековКоррекции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DocumentJournal>
		<Properties>
			<Name>ЖурналЧековКоррекции</Name>
			<RegisteredDocuments>
				<xr:Item>Document.КассовыйЧекКоррекции</xr:Item>
				<xr:Item>Document.ЧекКоррекции</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Автор</Name>
					<References>
						<xr:Item>Document.КассовыйЧекКоррекции.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ЧекКоррекции.Attribute.АвторДокумента</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Касса</Name>
					<References>
						<xr:Item>Document.КассовыйЧекКоррекции.Attribute.КассаККМ</xr:Item>
						<xr:Item>Document.ЧекКоррекции.Attribute.Касса</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<References>
						<xr:Item>Document.КассовыйЧекКоррекции.Attribute.НомерЧекаККМ</xr:Item>
						<xr:Item>Document.ЧекКоррекции.Attribute.НомерЧекаККМ</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Организация</Name>
					<References>
						<xr:Item>Document.ЧекКоррекции.Attribute.Организация</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<References>
						<xr:Item>Document.КассовыйЧекКоррекции.Attribute.СтруктурнаяЕдиница</xr:Item>
						<xr:Item>Document.ЧекКоррекции.Attribute.СтруктурнаяЕдиница</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ТипРасчета</Name>
					<References>
						<xr:Item>Document.КассовыйЧекКоррекции.Attribute.ТипРасчета</xr:Item>
						<xr:Item>Document.ЧекКоррекции.Attribute.ТипРасчета</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

src/DocumentJournals/ЖурналЧековКоррекции/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктурнаяЕдиницаОтбор	= ОбщегоНазначенияСтоматология.ПолучитьЗначениеПараметровСеанса("ТекущаяСтруктурнаяЕдиница");
	ОрганизацияОтбор		= СтруктурнаяЕдиницаОтбор.Организация;
	КассаОтбор				= СтруктурнаяЕдиницаОтбор.ОсновнаяКасса;
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Организация"			, ОрганизацияОтбор			, ЗначениеЗаполнено(ОрганизацияОтбор));
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Касса"				, КассаОтбор				, ЗначениеЗаполнено(КассаОтбор));
   	// СтандартныеПодсистемы.ПодключаемыеКоманды
	//ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

&НаКлиенте
// Процедура - обработчик команды "СоздатьЧекКоррекции".
//
Процедура СоздатьЧекКоррекции(Команда)
	
	ОткрытьФорму("Документ.ЧекКоррекции.ФормаОбъекта");
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды "СкопироватьЧекКоррекции".
//
Процедура СкопироватьЧекКоррекции(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Ссылка) = Тип("ДокументСсылка.КассовыйЧекКоррекции") Тогда
		ОткрытьФорму("Документ.ЧекКоррекции.ФормаОбъекта");
	Иначе
        ОткрытьФорму("Документ.ЧекКоррекции.ФормаОбъекта", Новый Структура("ЗначениеКопирования", ТекущиеДанные.Ссылка), ЭтаФорма);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура СтруктурнаяЕдиницаОтборПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "СтруктурнаяЕдиница", СтруктурнаяЕдиницаОтбор, ЗначениеЗаполнено(СтруктурнаяЕдиницаОтбор));
	
	ОрганизацияОтбор = Неопределено;
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Организация", ОрганизацияОтбор, ЗначениеЗаполнено(ОрганизацияОтбор));
	
	КассаОтбор = Неопределено;
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Касса", КассаОтбор, ЗначениеЗаполнено(КассаОтбор));
		
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура ОрганизацияОтборПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Организация", ОрганизацияОтбор, ЗначениеЗаполнено(ОрганизацияОтбор));
	КассаОтбор = Неопределено;
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Касса", КассаОтбор, ЗначениеЗаполнено(КассаОтбор));
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении".
//
Процедура КассаОтборПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Касса", КассаОтбор, ЗначениеЗаполнено(КассаОтбор));
	
КонецПроцедуры

#КонецОбласти
